CSI API ETABS v1
cFrameObj.SetSpandrel Method
 Sets the Spandrel label assignment of one or more frame objects
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSpandrel(
	string Name,
	string SpandrelName,
	eItemType ItemType = eItemType.Objects
)
Function SetSpandrel (
	Name As String,
	SpandrelName As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim SpandrelName As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetSpandrel(Name,
	SpandrelName, ItemType)
int SetSpandrel(
	String^ Name,
	String^ SpandrelName,
	eItemType ItemType = eItemType::Objects
)
abstract SetSpandrel :
        Name : string *
        SpandrelName : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
SpandrelName
Type: System.String
 The name of the Spandrel assignment, or "None", to unset any assignment
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, assignment is made to all selected frame objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the assignment is successful; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim SpandrelName as String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Spandrel label
    ret = SapModel.SpandrelLabel.SetSpandrel("MySpandrel")
'set assignment
    ret = SapModel.FrameObj.SetSpandrel("3", "MySpandrel")
'get assignment
    ret = SapModel.FrameObj.GetSpandrel("3", SpandrelName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace